app/controllers/meets_controller.rb

SELECT "meets".* FROM "meets"
---
	def index
		@meets = Meet.all