app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a test"], ["description", "this is a desc"], ["created_at", "2015-06-04 03:30:58.920137"], ["updated_at", "2015-06-04 03:30:58.920137"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "title" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["title", "Comeon man, no title?"], ["updated_at", "2015-06-05 04:48:23.367062"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)